int/resources/objectRepo/xmlTemplates/opera/Housekeeping/req_AutoGenerateTaskSheets.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/fof/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:AutoGenerateTaskSheetsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria HotelCode="?" MaximumCreditsPerSheet="?" NumberOfAttendants="?" OverrideTaskTemplate="?" RateCode="?" ReturnTaskSheets="?" Room="?" SectionTypeToUse="?" SeparateDNDRooms="?" SeparateNSRRooms="?" SheetOrderBy="?" StayOverFirst="?" TaskDate="?" TemplateCode="?" TemplateDescription="?" Turndown="?" VIPOnly="?">
            <v91:TaskCodes>
               <v91:TaskCode/>
            </v91:TaskCodes>
            <v91:Attendants>
               <v91:AttendantID/>
            </v91:Attendants>
            <v91:RoomClassList>
               <v91:RoomClass/>
            </v91:RoomClassList>
            <v91:Status>
               <v91:HousekeepingRoomStatusList>
                  <v91:HousekeepingRoomStatus/>
               <v91:HousekeepingRoomStatus/><v91:HousekeepingRoomStatus/><v91:HousekeepingRoomStatus/><v91:HousekeepingRoomStatus/><v91:HousekeepingRoomStatus/></v91:HousekeepingRoomStatusList>
               <v91:FrontOfficeRoomStatusList>
                  <v91:FrontOfficeRoomStatus/>
               </v91:FrontOfficeRoomStatusList>
               <v91:ReservationStatusList>
                  <v91:ReservationStatus/>
               </v91:ReservationStatusList>
               <v91:TurndownStatusList>
                  <v91:TurndownStatus/>
               </v91:TurndownStatusList>
               <v91:RoomAssignmentStatusList>
                  <v91:RoomAssignmentStatus/>
               <v91:RoomAssignmentStatus/></v91:RoomAssignmentStatusList>
            </v91:Status>
            <v91:Instructions>
               <v91:TaskInstructions/>
               <v91:RoomInstructions/>
               <v91:AttendantInstructions/>
            </v91:Instructions>
            <v91:ExcludeVIPCodes>
               <v91:VIPCode/>
            </v91:ExcludeVIPCodes>
         </v9:Criteria>
      </v9:AutoGenerateTaskSheetsRQ>
   </soapenv:Body>
</soapenv:Envelope>